In [2]:
import pandas as pd 
import numpy as np

In [3]:
dict_data = {
    'edad': [10,9,13,14,12,11,12],
    'cm': [115,110,130,155,125,120,125],
    'pais':['co','mx','co','mx','mx','ch','ch'],
    'genero':['M','F','F','M','M','M','F'],
    'Q1':[5,10,8,np.nan,7,8,3],
    'Q2':[7,9,9,8,8,8,9]
}
df = pd.DataFrame(dict_data, index = ['ana','benito','camilo','daniel','erika','fabian','gabriela'])
df.head()

        edad   cm pais genero    Q1  Q2
ana       10  115   co      M   5.0   7
benito     9  110   mx      F  10.0   9
camilo    13  130   co      F   8.0   9
daniel    14  155   mx      M   NaN   8
erika     12  125   mx      M   7.0   8

#### CSV

In [10]:
df.to_csv("./db/notas.csv", index=False)

In [11]:
df_read = pd.read_csv("./db/notas.csv")
df_read.head()

   edad   cm pais genero    Q1  Q2
0    10  115   co      M   5.0   7
1     9  110   mx      F  10.0   9
2    13  130   co      F   8.0   9
3    14  155   mx      M   NaN   8
4    12  125   mx      M   7.0   8

#### Bases de datos SQL

In [12]:
# Conexi贸n con PostgreSQL 
# import psycopg2 
# conn_sql = psycopg2.connect(user = "user_name",
#                             password = "password",
#                             host = "xxx.xxx.xxx.xxx",
#                             port = "5432",
#                             database = "postgres_db_name")
# query_sql = '''
# select *
# from table_name
# limit 10
# '''
# df = pd.read_sql(query_sql, sql_conn)
# df.head(5)

In [ ]:
# Conexi贸n con SQL Server
# import pyodbs
# driver = '{SQL Server}'
# server_name = 'server_name'
# db_name = 'database_name'
# user = 'user'
# password = 'password'
# sql_conn = pyodbc.connect('''
# DRIVER={};SERVER={};DATABASE={};UID={};PWD={};
# Trusted_Connection=yes
# '''.format(driver, server_name, db_name, user, password))
# query_sql = 'select * from table_name limit 10'
# df = pd.read_sql(query_sql, sql_conn)
# df.head(5)

In [ ]:
# Conexi贸n con MySQL
# import pandas as pd
# import sqlalchemy as sql
# Escogemos nuestra base de datos, Oracle, MySql o la de tu preferencia:
# database_type = 'mysql'
# database_type = 'oracle'
# user = 'user_name'
# password = 'password'
# host = 'xxx.xxx.xxx.xxx:port'
# database = 'database_name'

# conn_string = '{}://{}:{}@{}/{}'.format(
# database_type, user, password, host, database)

# sql_conn = sql.create_engine(conn_string)
# query_sql = '''
# select *
# from table_name
# limit 10
# '''
# df = pd.read_sql(query_sql, sql_conn)
# df.head(5)

#### Excel

In [15]:
df.to_excel("./db/notas.xlsx",index=False)
df_excel = pd.read_excel("./db/notas.xlsx")
df_excel.head()

   edad   cm pais genero    Q1  Q2
0    10  115   co      M   5.0   7
1     9  110   mx      F  10.0   9
2    13  130   co      F   8.0   9
3    14  155   mx      M   NaN   8
4    12  125   mx      M   7.0   8

#### Json

In [16]:
df.to_json("./db/notas.json")
df_json = pd.read_json("./db/notas.json")
df_json.head

<bound method NDFrame.head of           edad   cm pais genero    Q1  Q2
ana         10  115   co      M   5.0   7
benito       9  110   mx      F  10.0   9
camilo      13  130   co      F   8.0   9
daniel      14  155   mx      M   NaN   8
erika       12  125   mx      M   7.0   8
fabian      11  120   ch      M   8.0   8
gabriela    12  125   ch      F   3.0   9>

#### Parquet y pickle
Archivos binarios para almacenar datos en big-data

In [3]:
df_met = pd.read_csv("./db/Meteorite_Landings.csv")
df_met.head(5)

,name,id,nametype,recclass,mass (g),fall,year,reclat,reclong,GeoLocation
0,Aachen,1,Valid,L5,21.0,Fell,01/01/1880 12:00:00 AM,50.77500,6.08333,"(50.775, 6.08333)"
1,Aarhus,2,Valid,H6,720.0,Fell,01/01/1951 12:00:00 AM,56.18333,10.23333,"(56.18333, 10.23333)"
2,Abee,6,Valid,EH4,107000.0,Fell,01/01/1952 12:00:00 AM,54.21667,-113.00000,"(54.21667, -113.0)"
3,Acapulco,10,Valid,Acapulcoite,1914.0,Fell,01/01/1976 12:00:00 AM,16.88333,-99.90000,"(16.88333, -99.9)"
4,Achiras,370,Valid,L6,780.0,Fell,01/01/1902 12:00:00 AM,-33.16667,-64.95000,"(-33.16667, -64.95)"

In [4]:
df_met.tail(5)

,name,id,nametype,recclass,mass (g),fall,year,reclat,reclong,GeoLocation
45711,Zillah 002,31356,Valid,Eucrite,172.0,Found,01/01/1990 12:00:00 AM,29.03700,17.01850,"(29.037, 17.0185)"
45712,Zinder,30409,Valid,"Pallasite, ungrouped",46.0,Found,01/01/1999 12:00:00 AM,13.78333,8.96667,"(13.78333, 8.96667)"
45713,Zlin,30410,Valid,H4,3.3,Found,01/01/1939 12:00:00 AM,49.25000,17.66667,"(49.25, 17.66667)"
45714,Zubkovsky,31357,Valid,L6,2167.0,Found,01/01/2003 12:00:00 AM,49.78917,41.50460,"(49.78917, 41.5046)"
45715,Zulu Queen,30414,Valid,L3.7,200.0,Found,01/01/1976 12:00:00 AM,33.98333,-115.68333,"(33.98333, -115.68333)"

In [5]:
df_met.sample(5)

,name,id,nametype,recclass,mass (g),fall,year,reclat,reclong,GeoLocation
37484,Shiraiwa,23537,Valid,H4,950.00,Found,01/01/1915 12:00:00 AM,39.50000,140.20000,"(39.5, 140.2)"
15079,Grove Mountains 051797,50312,Valid,L6,8.14,Found,01/01/2006 12:00:00 AM,-72.77889,75.33278,"(-72.77889, 75.33278)"
8058,Dhofar 687,7444,Valid,H5/6,945.00,Found,01/01/2001 12:00:00 AM,19.34150,54.72497,"(19.3415, 54.72497)"
45509,Yamato 983906,40526,Valid,H5,21.76,Found,01/01/1998 12:00:00 AM,0.00000,0.00000,"(0.0, 0.0)"
4885,Asuka 882012,4721,Valid,L6,18.92,Found,01/01/1988 12:00:00 AM,-72.00000,26.00000,"(-72.0, 26.0)"

In [22]:
df_met.shape

(45716, 10)

In [96]:
# Opciones de visualizaci贸n
pd.options.display.float_format = '{:.1f}'.format

# Info de las variables numericas
df_met.describe(include='all')

,name,id,nametype,recclass,mass (g),fall,year,reclat,reclong,GeoLocation
count,45716,45716.0,45716,45716,45585.0,45716,45425,38401.0,38401.0,38401
unique,45716,NaN,2,466,NaN,2,266,NaN,NaN,17100
top,Aachen,NaN,Valid,L6,NaN,Found,01/01/2003 12:00:00 AM,NaN,NaN,"(0.0, 0.0)"
freq,1,NaN,45641,8285,NaN,44609,3323,NaN,NaN,6214
mean,NaN,26889.7,NaN,NaN,13278.1,NaN,NaN,-39.1,61.1,NaN
std,NaN,16860.7,NaN,NaN,574988.9,NaN,NaN,46.4,80.6,NaN
min,NaN,1.0,NaN,NaN,0.0,NaN,NaN,-87.4,-165.4,NaN
25%,NaN,12688.8,NaN,NaN,7.2,NaN,NaN,-76.7,0.0,NaN
50%,NaN,24261.5,NaN,NaN,32.6,NaN,NaN,-71.5,35.7,NaN
75%,NaN,40656.8,NaN,NaN,202.6,NaN,NaN,0.0,157.2,NaN
max,NaN,57458.0,NaN,NaN,60000000.0,NaN,NaN,81.2,354.5,NaN

In [7]:
df_met.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 45716 entries, 0 to 45715
Data columns (total 10 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   name         45716 non-null  object
 1   id           45716 non-null  int64
 2   nametype     45716 non-null  object
 3   recclass     45716 non-null  object
 4   mass (g)     45585 non-null  float64
 5   fall         45716 non-null  object
 6   year         45425 non-null  object
 7   reclat       38401 non-null  float64
 8   reclong      38401 non-null  float64
 9   GeoLocation  38401 non-null  object
dtypes: float64(3), int64(1), object(6)
memory usage: 3.5+ MB

#### Variables categoricas

In [9]:
df_met.nunique()

name           45716
id             45716
nametype           2
recclass         466
mass (g)       12576
fall               2
year             266
reclat         12738
reclong        14640
GeoLocation    17100
dtype: int64

In [10]:
df_met.dtypes

name            object
id               int64
nametype        object
recclass        object
mass (g)       float64
fall            object
year            object
reclat         float64
reclong        float64
GeoLocation     object
dtype: object

In [11]:
# Cambio de objects a variables categoricas
df_met[['nametype','fall']] = df_met[['nametype','fall']].astype('category')

In [12]:
df_met.dtypes

name             object
id                int64
nametype       category
recclass         object
mass (g)        float64
fall           category
year             object
reclat          float64
reclong         float64
GeoLocation      object
dtype: object

#### Borrar

In [ ]:
# df_met.drop([])

#### Copiar

In [13]:
df_met2 = df_met.copy(deep=True)

#### Operaciones con columnas

In [15]:
df_bikes = pd.read_csv("./db/london_merged.csv")
df_bikes.head()

,timestamp,cnt,t1,t2,hum,wind_speed,weather_code,is_holiday,is_weekend,season
0,2015-01-04 00:00:00,182,3.0,2.0,93.0,6.0,3.0,0.0,1.0,3.0
1,2015-01-04 01:00:00,138,3.0,2.5,93.0,5.0,1.0,0.0,1.0,3.0
2,2015-01-04 02:00:00,134,2.5,2.5,96.5,0.0,1.0,0.0,1.0,3.0
3,2015-01-04 03:00:00,72,2.0,2.0,100.0,0.0,1.0,0.0,1.0,3.0
4,2015-01-04 04:00:00,47,2.0,0.0,93.0,6.5,1.0,0.0,1.0,3.0

In [16]:
df_bikes.dtypes

timestamp        object
cnt               int64
t1              float64
t2              float64
hum             float64
wind_speed      float64
weather_code    float64
is_holiday      float64
is_weekend      float64
season          float64
dtype: object

In [17]:
df_bikes['timestamp'] = pd.to_datetime(df_bikes['timestamp'])
df_bikes.dtypes

timestamp       datetime64[ns]
cnt                      int64
t1                     float64
t2                     float64
hum                    float64
wind_speed             float64
weather_code           float64
is_holiday             float64
is_weekend             float64
season                 float64
dtype: object

In [19]:
df_bikes['hour'] = df_bikes['timestamp'].dt.hour
df_bikes.head()

,timestamp,cnt,t1,t2,hum,wind_speed,weather_code,is_holiday,is_weekend,season,hour
0,2015-01-04 00:00:00,182,3.0,2.0,93.0,6.0,3.0,0.0,1.0,3.0,0
1,2015-01-04 01:00:00,138,3.0,2.5,93.0,5.0,1.0,0.0,1.0,3.0,1
2,2015-01-04 02:00:00,134,2.5,2.5,96.5,0.0,1.0,0.0,1.0,3.0,2
3,2015-01-04 03:00:00,72,2.0,2.0,100.0,0.0,1.0,0.0,1.0,3.0,3
4,2015-01-04 04:00:00,47,2.0,0.0,93.0,6.5,1.0,0.0,1.0,3.0,4

#### Aplicar funciones

.apply()

Se pueden usar funciones previamente definidad o se pueden usar funciones anonimas

In [23]:
df_bikes['hour'].apply(lambda x: x+1)

0         1
1         2
2         3
3         4
4         5
         ..
17409    20
17410    21
17411    22
17412    23
17413    24
Name: hour, Length: 17414, dtype: int64

In [37]:
df_bikes.iloc[:,1:].apply(lambda x: x.mean(), axis=0)

cnt            1143.1
t1               12.5
t2               11.5
hum              72.3
wind_speed       15.9
weather_code      2.7
is_holiday        0.0
is_weekend        0.3
season            1.5
hour             11.5
dtype: float64

#### Multiples indices

In [44]:
df_pob = pd.read_csv("./db/poblacion.csv")
pd.options.display.float_format = '{:,.1f}'.format
df_pob.head()

          Country  year          pop
0     Afghanistan  2015 34,413,603.0
1         Albania  2015  2,880,703.0
2         Algeria  2015 39,728,025.0
3  American Samoa  2015     55,812.0
4         Andorra  2015     78,011.0

In [46]:
df_pob["year"] = pd.Categorical(df_pob["year"].apply(str))
df_pob.dtypes

Country      object
year       category
pop         float64
dtype: object

In [54]:
idx_filtro = df_pob["Country"].isin(['Aruba','Colombia'])
df_pob_sam = df_pob[idx_filtro]
df_pob_sam.head()

      Country  year          pop
9       Aruba  2015    104,341.0
42   Colombia  2015 47,520,667.0
269     Aruba  2016    104,872.0
302  Colombia  2016 48,171,392.0
529     Aruba  2017    105,366.0

In [55]:
df_pob_sam = df_pob_sam.set_index(['Country','year']).sort_index()
df_pob_sam

                       pop
Country  year
Aruba    2015    104,341.0
         2016    104,872.0
         2017    105,366.0
         2018    105,845.0
Colombia 2015 47,520,667.0
         2016 48,171,392.0
         2017 48,901,066.0
         2018 49,648,685.0

In [59]:
df_pob_sam.xs(('Colombia'))

              pop
year
2015 47,520,667.0
2016 48,171,392.0
2017 48,901,066.0
2018 49,648,685.0

In [63]:
df_countries = df_pob.set_index(['Country','year']).sort_index(ascending=[True,False])
df_countries

                          pop
Country     year
Afghanistan 2018 37,172,386.0
            2017 36,296,400.0
            2016 35,383,128.0
            2015 34,413,603.0
Albania     2018  2,866,376.0
...                       ...
Zambia      2015 15,879,361.0
Zimbabwe    2018 14,439,018.0
            2017 14,236,745.0
            2016 14,030,390.0
            2015 13,814,629.0

[1040 rows x 1 columns]

In [72]:
df_countries.loc[pd.IndexSlice['Colombia':"Congo"]]

                       pop
Country  year
Colombia 2018 49,648,685.0
         2017 48,901,066.0
         2016 48,171,392.0
         2015 47,520,667.0
Comoros  2018    832,322.0
         2017    813,892.0
         2016    795,592.0
         2015    777,424.0

In [85]:
df_pob_sam.unstack('year')

                  pop
year             2015         2016         2017         2018
Country
Aruba       104,341.0    104,872.0    105,366.0    105,845.0
Colombia 47,520,667.0 48,171,392.0 48,901,066.0 49,648,685.0

In [89]:
df = pd.DataFrame({
    'edad' :     [ 10, 9, 13, 14, 12, 11, 12],
    'cm' : [ 115, 110, 130, 155, 125, 120, 125],
    'pais' :    [ 'co', 'mx', 'co', 'mx', 'mx', 'ch', 'ch'],
    'genero' :  [ 'F', 'M', 'M', 'M', 'F', 'F', 'F'],
    'Q1' : [ 5, 10, 8, np.nan, 7, 8, 3],
    'Q2' : [ 7, 9, 9, 8, 8, 8, 9.]
}, index = ['Ana','Benito','Camilo','Daniel','Erika','Paola','Gabriela'])

print(df.iloc[[4],[2]])

      pais
Erika   mx

In [90]:
pd.Series([10,8,5,0]) - pd.Series([0,1,6,12])
df.agg()

0    10
1     7
2    -1
3   -12
dtype: int64

In [91]:
pd.NA | False

In [92]:
[10,8,5,0] + [0,1,6,12]

[10, 8, 5, 0, 0, 1, 6, 12]

#### Concatenaci贸n

In [99]:
a1 = np.random.rand(2,5)*100
a2 = np.random.rand(2,5)*-100
print(a1,a2)

[[85.71845319  8.78125503 94.92409383 36.9002589  52.10065583]
 [69.43041153 50.23526726 37.84133784 94.9438438  38.68839608]] [[-31.9744712  -50.97170187 -13.21362203 -98.9624874  -15.18052076]
 [-87.74159607 -17.34139711 -56.84388036 -25.48443024 -27.61224423]]

In [102]:
np.concatenate([a1,a2]).shape # Concatenacion vertical

(4, 5)

In [103]:
np.concatenate([a1,a2],axis=1).shape # Concatenacion horizontal

(2, 10)

In [109]:
s1 = pd.Series(a1[0,:],index=['a','b','c','d','e'])
s2 = pd.Series(a2[0,:],index=['c','d','e','f','g'])

In [111]:
pd.concat([s1,s2]) # Concatenacion vertical

a    85.7
b     8.8
c    94.9
d    36.9
e    52.1
c   -32.0
d   -51.0
e   -13.2
f   -99.0
g   -15.2
dtype: float64

In [112]:
pd.concat([s1,s2],axis=1) # Concatenacion horizontal -> Respetando los indices IMPORTANTE

     0     1
a 85.7   NaN
b  8.8   NaN
c 94.9 -32.0
d 36.9 -51.0
e 52.1 -13.2
f  NaN -99.0
g  NaN -15.2

In [121]:
df_con1  = pd.DataFrame(a1[:,0:3],columns=['a','b','c'])
df_con1

     a    b    c
0 85.7  8.8 94.9
1 69.4 50.2 37.8

In [126]:
df_con2  = pd.DataFrame(a2[:,0:3],columns=['a','b','c'],index=[1,2])
df_con2

      a     b     c
1 -32.0 -51.0 -13.2
2 -87.7 -17.3 -56.8

In [127]:
pd.concat([df_con1,df_con2]) # Concatenaci贸n vertical

      a     b     c
0  85.7   8.8  94.9
1  69.4  50.2  37.8
1 -32.0 -51.0 -13.2
2 -87.7 -17.3 -56.8

In [128]:
pd.concat([df_con1,df_con2], axis=1) # Concatenaci贸n horizontal -> Respeta el indice

     a    b    c     a     b     c
0 85.7  8.8 94.9   NaN   NaN   NaN
1 69.4 50.2 37.8 -32.0 -51.0 -13.2
2  NaN  NaN  NaN -87.7 -17.3 -56.8

In [132]:
pd.concat([df_con1,df_con2], axis=1, join='inner') # Usando indice comun

     a    b    c     a     b     c
1 69.4 50.2 37.8 -32.0 -51.0 -13.2

In [133]:
df_con1.append(df_con2) # Concatenaci贸n vertical

      a     b     c
0  85.7   8.8  94.9
1  69.4  50.2  37.8
1 -32.0 -51.0 -13.2
2 -87.7 -17.3 -56.8

In [134]:
df_con1.T.append(df_con2.T) # No es recomendable, porque se invierten indices y columnas

     0     1     2
a 85.7  69.4   NaN
b  8.8  50.2   NaN
c 94.9  37.8   NaN
a  NaN -32.0 -87.7
b  NaN -51.0 -17.3
c  NaN -13.2 -56.8

#### Merging

In [136]:
df_left = pd.DataFrame(
    {'X':['x0','x1','x2','x3'],
    'W':['w0','w1','w2','w3'],
    'Y':['y0','y1','y2','y3'],
    'Mix':['y2','y3','a2','a3']},
    index = ['y2','y3','a2','a3'])
df_left.head()

     X   W   Y Mix
y2  x0  w0  y0  y2
y3  x1  w1  y1  y3
a2  x2  w2  y2  a2
a3  x3  w3  y3  a3

In [137]:
df_right = pd.DataFrame(
    {'Z':['z2','z3','z4','z5'],
     'A':['a2','a3','a4','a5'],
     'Y':['y2','y3','y4','y5']},
    index = [2,3,4,5])
df_right.head()

    Z   A   Y
2  z2  a2  y2
3  z3  a3  y3
4  z4  a4  y4
5  z5  a5  y5

In [139]:
pd.merge(df_left, df_right) # Une por elementos en com煤n dentro del dataframe

    X   W   Y Mix   Z   A
0  x2  w2  y2  a2  z2  a2
1  x3  w3  y3  a3  z3  a3

In [140]:
pd.merge(df_left, df_right, how='inner', on='Y')

    X   W   Y Mix   Z   A
0  x2  w2  y2  a2  z2  a2
1  x3  w3  y3  a3  z3  a3

![plot](./imagenes/merge.png)

In [ ]:
pd.re